# Copyright (c) 2026, NVIDIA CORPORATION & AFFILIATES.  All rights reserved.
#
# Licensed under the Apache License, Version 2.0 (the "License");
# you may not use this file except in compliance with the License.
# You may obtain a copy of the License at
#
#     http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.

name: "voicechat"
default_model_filename: "infer_streaming.py"
backend: "python"
max_batch_size: 0

input {
  name: "audio_signal"
  data_type: TYPE_FP32
  dims: [-1, -1]
}

output {
    name: "output_text"
    data_type: TYPE_STRING
    dims: [-1]
}

output {
    name: "output_asr_text"
    data_type: TYPE_STRING
    dims: [-1]
}

output [
  {
    name: "output_audio"
    data_type: TYPE_FP32
    dims: [-1, -1]
  }
]

sequence_batching {
  max_sequence_idle_microseconds: 30000000
  oldest
    {
      max_candidate_sequences: 1
    }
  control_input [
    {
      name: "START"
      control [
        {
          kind: CONTROL_SEQUENCE_START
          fp32_false_true: [ 0, 1 ]
        }
      ]
    },
    {
      name: "END"
      control [
        {
          kind: CONTROL_SEQUENCE_END
          fp32_false_true: [ 0, 1 ]
        }
      ]
    },
    {
      name: "CORRID"
      control [
        {
          kind: CONTROL_SEQUENCE_CORRID
          data_type: TYPE_UINT64
        }
      ]
    }
  ]
}

instance_group [{ kind: KIND_GPU, gpus: [0] }]
